using System;
using System.Collections.Generic;
using System.Text;

namespace BusinessLogicLayer.Interfaces
{
    public interface IEmployeeService
    {
        // актвировать клиента
        // заблокировать клиента

        // активировать счет
        // заморозить счет
        // закрыть счет
        // заблокировать счет

        // активировать(одобрить) кредит
        // закрыть кредит
        // отклонить (не одобрить) кредит

        // активировать(одобрить) депозит
        // закрыть депозит
        // отклонить (не одобрить) депозит

        // заморозить транзакцию
        // отменить транзакцию
    }
}
